# Palmers Penguins 
This notebook contains my analysis of the famous palmer penguins dataset.
The data set is available [on GitHub](https://allisonhorst.github.io/palmerpenguins/)

# Background of the Palmer Penguins dataset 

The Palmer Penguins dataset, orginally created to study Antarctic penguins’ foraging behavior and relationship with environmental variability, is a commonly used dataset for data exploration and visualization.

The dataset was collected by [Dr.Kristen Gorman](https://www.uaf.edu/cfos/people/faculty/detail/kristen-gorman.php) with  the [Palmer Station, Antarctica, Long-Term Ecological Research program](https://pallter.marine.rutgers.edu/).

The dataset tracks three species of penguin across various locations measuring different attributes of the penguin i.e. flipper length, body mass, sex and bill length and depth.

##### Species:
|Adelie    |Gentoo | Chinstrap|
|-----------|---------------|------------|
|![Adelie](https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Hope_Bay-2016-Trinity_Peninsula%E2%80%93Ad%C3%A9lie_penguin_%28Pygoscelis_adeliae%29_04.jpg/173px-Hope_Bay-2016-Trinity_Peninsula%E2%80%93Ad%C3%A9lie_penguin_%28Pygoscelis_adeliae%29_04.jpg)|![Gentoo](https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Gentoo_Penguin_Baby_%2824940372635%29.jpg/209px-Gentoo_Penguin_Baby_%2824940372635%29.jpg)|![Chinstrap](https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/South_Shetland-2016-Deception_Island%E2%80%93Chinstrap_penguin_%28Pygoscelis_antarctica%29_04.jpg/160px-South_Shetland-2016-Deception_Island%E2%80%93Chinstrap_penguin_%28Pygoscelis_antarctica%29_04.jpg)|

##### Locations: 
*Torgersen, Biscoe & Dream* islands

The version of the dataset used in this project focuses on a reduced amount of variables from the original dataset, including:
   - Species of penguin
   - Island the penguin was located on
   - Bill length and depth (mm)
   - Flipper length (mm)
   - Body mass (g)
   - Sex of the penguin

In [8]:
# Data frames. 
import pandas as pd

In [9]:
# Load the penguins data set.
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/penguins.csv")

In [10]:
#Looking at the data set.
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [11]:
#Look at a specific row, example below shows row 0.
df.iloc[0]

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       MALE
Name: 0, dtype: object

In [12]:
#Look at specific column, example below shows "sex" column.
df["sex"]

0        MALE
1      FEMALE
2      FEMALE
3         NaN
4      FEMALE
        ...
339       NaN
340    FEMALE
341      MALE
342    FEMALE
343      MALE
Name: sex, Length: 344, dtype: object

In [13]:
#Count the number of penguins of each sex.
df["sex"].value_counts()

sex
MALE      168
FEMALE    165
Name: count, dtype: int64

In [14]:
#Describe the data set, returns different calculations of the numerical values in the data set.
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

## Tables 

***

|Species    |Bill length (mm)|Body mass (g)|
|-----------|---------------:|------------:|
|Adelie     |            38.8|         3701|
|Chinstrap  |            48.9|         3722|
|Gentoo     |            47.5|         5076|

***
### End